In [1]:
''' It happens all the time: someone gives you data containing malformed strings, Python, lists and
missing data. How do you tidy it up so you can get on with the analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:'''

' It happens all the time: someone gives you data containing malformed strings, Python, lists and\nmissing data. How do you tidy it up so you can get on with the analysis?\nTake this monstrosity as the DataFrame to use in the following puzzles:'

In [2]:
import numpy as np
import pandas as pd

In [3]:
%matplotlib inline

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
df.describe()

       FlightNumber
count           3.0
mean        10065.0
std            20.0
min         10045.0
25%         10055.0
50%         10065.0
75%         10075.0
max         10085.0

In [7]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [9]:
''' 1.Some values in the the FlightNumber column are missing. These numbers are meant to
increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing
numbers and make the column an integer column (instead of a float column).'''

' 1.Some values in the the FlightNumber column are missing. These numbers are meant to\nincrease by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing\nnumbers and make the column an integer column (instead of a float column).'

In [13]:
df['FlightNumber'].loc[1] = (df['FlightNumber'].iloc[0] + 10)
df['FlightNumber'].loc[3] = (df['FlightNumber'].iloc[2] + 10)
df['FlightNumber'] = df['FlightNumber'].astype(float)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [14]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [15]:
''' 2. The From_To column would be better as two separate columns! Split each string on the
underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the
correct column names to this temporary DataFrame.'''

' 2. The From_To column would be better as two separate columns! Split each string on the\nunderscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the\ncorrect column names to this temporary DataFrame.'

In [16]:
tDF = pd.DataFrame(df.From_To)
tDF['From'] = tDF.From_To.str.split('_').str.get(0)
tDF['To'] = tDF.From_To.str.split('_').str.get(1)
tDF = tDF.drop('From_To', 1)

In [17]:
tDF

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [18]:
pd.DataFrame

pandas.core.frame.DataFrame

In [19]:
''' 3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame.
Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become
"London".)'''

' 3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame.\nStandardise the strings so that only the first letter is uppercase (e.g. "londON" should become\n"London".)'

In [24]:
tDF['From'] = tDF.From.str.title()
tDF['To'] = tDF.To.str.title()

In [25]:
tDF

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [26]:
'''4.Delete the From_To column from df and attach the temporary DataFrame from the previous
questions.'''

'4.Delete the From_To column from df and attach the temporary DataFrame from the previous\nquestions.'

In [27]:
df = df.drop('From_To', 1)
df = pd.concat([tDF,df], axis = 1)

In [28]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

In [29]:
''' 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We
would like each first value in its own column, each second value in its own column, and so on. If
there isn't an Nth value, the value should be NaN.'''

" 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We\nwould like each first value in its own column, each second value in its own column, and so on. If\nthere isn't an Nth value, the value should be NaN."

In [30]:
FixAirline = pd.DataFrame(df.Airline)
a = '()<>1234567890,.?!""[]{} '
FixAirline['Airline'] = FixAirline['Airline'].map(lambda x: x.strip(a))
df = df.drop('Airline', 1)
df = pd.concat([df,FixAirline], axis = 1)